<a href="https://colab.research.google.com/github/quantummouse/dm_pandas/blob/master/Data612_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


    Alexandria Kalika
    Assignment 1
    
    Select the dataset of your choice from the list provided here.
    Load the dataset using Jupyter notebook and explore the data by using the following.

    Show the .head() and .tail() of the data set. Specify the number of rows to print using .head() and .tail().
    Print the column names.
    Print to see what is the type of your data set
    Check number of rows and columns.
    Use groupby() and find the mean on your selected colum/s.
    Add a README file in GitHub where you explain everything you did.

In [1]:
import pandas as pd

In [11]:
df = pd.read_csv("/content/drive/My Drive/Colab Notebooks/State_Drug_Utilization_Data_2010.csv")

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (4,19) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [12]:
df.head(4)

  Utilization Type State  ...             Location          NDC
0             FFSU    WI  ...   (37.768, -78.2057)  17478021420
1             FFSU    NH  ...   (47.5362, -99.793)    409116502
2             FFSU    XX  ...                  NaN    338062904
3             FFSU    TN  ...  (41.6772, -71.5101)  68382009906

[4 rows x 20 columns]

In [13]:
df.tail(4)

        Utilization Type State  ...             Location          NDC
3124385             FFSU    MN  ...  (43.3504, -84.5603)  60505037401
3124386             FFSU    MO  ...  (45.7326, -93.9196)  00591041001
3124387             MCOU    NJ  ...  (41.1289, -98.2883)  00603568420
3124388             FFSU    ID  ...   (42.0046, -93.214)  51672129803

[4 rows x 20 columns]

In [22]:
#column names

for col in df.columns: print(col)

Utilization Type
State
Labeler Code
Product Code
Package Size
Year
Quarter
Product Name
Units Reimbursed
Suppression Used
Number of Prescriptions
Total Amount Reimbursed
Medicaid Amount Reimbursed
Non Medicaid Amount Reimbursed
Quarter Begin
Quarter Begin Date
Latitude
Longitude
Location
NDC

In [ ]:
#type of dataset
type(df)

In [40]:
#type of the elements
df.dtypes

Utilization_Type                   object
State                              object
Labeler_Code                        int64
Product_Code                        int64
Package_Size                       object
Year                                int64
Quarter                             int64
Product_Name                       object
Units_Reimbursed                  float64
Suppression_Used                     bool
Number_of_Prescriptions           float64
Total_Amount_Reimbursed           float64
Medicaid_Amount_Reimbursed        float64
Non_Medicaid_Amount_Reimbursed    float64
Quarter_Begin                      object
Quarter_Begin_Date                 object
Latitude                          float64
Longitude                         float64
Location                           object
NDC                                object
dtype: object

In [ ]:
#number of rows and columns 3124389 rows, 20 columns
df.shape

In [ ]:
#group by package size to find average of it.
#Dealing with spaces in column names
df.columns = df.columns.str.replace(' ','_')
print(df.columns)

In [ ]:
avg_size = df.groupby('State')['Total_Amount_Reimbursed'].mean()
print(avg_size)